blog_api/app/controllers/posts_controller.rb

  def create
    @title = params[:title]
    @body = params[:body]
    @author = params[:author]

    @new_post = Post.create title: @title, body: @body, author: @author
---
INSERT INTO "posts" ("title", "body", "author", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)